const categoryMap = {
    '1': '🎮 Казуал',
    '2': '🏆 Соревнующийся',
    '3': '🔥 Хардкорный',
};


const houseMap = {
    '0': '<:Guild_house_1:1285272003573715065> Палатка (+5% Xp',
    '1': '<:Guild_house_2:1285272421334777931> Конюшня (+10% Xp)',
    '2': '<:Guild_house_3:1285272437222674464> Мельница (+15% Xp)',
    '3': '<:Guild_house_4:1285272453928456283> Дом (+20% Xp)',
    '4': '<:Guild_house_5:1285272467551686737> Коттедж (+25% Xp)',
    '5': '<:Guild_house_6:1285272481149485107> Замок   (+30% Xp)',
};

module.exports = { categoryMap, houseMap };
